RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_usb.h
/***************************************************************************//**
 * @file
 * @brief EFM32GG12B_USB register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32GG12B_USB USB
 * @{
 * @brief EFM32GG12B_USB Register Declaration
 ******************************************************************************/
/** USB Register Declaration */
typedef struct {
  __IOM uint32_t   CTRL;               /**< System Control Register  */
  __IM uint32_t    STATUS;             /**< System Status Register  */
  __IM uint32_t    IF;                 /**< Interrupt Flag Register  */
  __IOM uint32_t   IFS;                /**< Interrupt Flag Set Register  */
  __IOM uint32_t   IFC;                /**< Interrupt Flag Clear Register  */
  __IOM uint32_t   IEN;                /**< Interrupt Enable Register  */
  __IOM uint32_t   ROUTE;              /**< I/O Routing Register  */

  uint32_t         RESERVED0[4U];      /**< Reserved for future use **/
  __IOM uint32_t   CDCONF;             /**< Charger Detect Configuration Register  */
  __IOM uint32_t   CMD;                /**< Command Register  */
  __IOM uint32_t   DATTRIM1;           /**< Data TRIM 1 Values for USB DP and DM  */

  uint32_t         RESERVED1[1U];      /**< Reserved for future use **/
  __IOM uint32_t   LEMCTRL;            /**< USB LEM Control Register  */
  __IOM uint32_t   ROUTELOC0;          /**< I/O Routing Location Register  */

  uint32_t         RESERVED2[227311U]; /**< Reserved for future use **/
  __IOM uint32_t   GOTGCTL;            /**< OTG Control and Status Register  */
  __IOM uint32_t   GOTGINT;            /**< OTG Interrupt Register  */
  __IOM uint32_t   GAHBCFG;            /**< AHB Configuration Register  */
  __IOM uint32_t   GUSBCFG;            /**< USB Configuration Register  */
  __IOM uint32_t   GRSTCTL;            /**< Reset Register  */
  __IOM uint32_t   GINTSTS;            /**< Interrupt Register  */
  __IOM uint32_t   GINTMSK;            /**< Interrupt Mask Register  */
  __IM uint32_t    GRXSTSR;            /**< Receive Status Debug Read Register  */
  __IM uint32_t    GRXSTSP;            /**< Receive Status Read /Pop Register  */
  __IOM uint32_t   GRXFSIZ;            /**< Receive FIFO Size Register  */
  __IOM uint32_t   GNPTXFSIZ;          /**< Non-periodic Transmit FIFO Size Register  */
  __IM uint32_t    GNPTXSTS;           /**< Non-periodic Transmit FIFO/Queue Status Register  */
  uint32_t         RESERVED3[4U];      /**< Reserved for future use **/
  __IM uint32_t    GSNPSID;            /**< Synopsys ID Register  */

  uint32_t         RESERVED4[6U];      /**< Reserved for future use **/
  __IOM uint32_t   GDFIFOCFG;          /**< Global DFIFO Configuration Register  */

  uint32_t         RESERVED5[40U];     /**< Reserved for future use **/
  __IOM uint32_t   HPTXFSIZ;           /**< Host Periodic Transmit FIFO Size Register  */
  __IOM uint32_t   DIEPTXF1;           /**< Device IN Endpoint Transmit FIFO Size Register 1  */
  __IOM uint32_t   DIEPTXF2;           /**< Device IN Endpoint Transmit FIFO Size Register 2  */
  __IOM uint32_t   DIEPTXF3;           /**< Device IN Endpoint Transmit FIFO Size Register 3  */
  __IOM uint32_t   DIEPTXF4;           /**< Device IN Endpoint Transmit FIFO Size Register 4  */
  __IOM uint32_t   DIEPTXF5;           /**< Device IN Endpoint Transmit FIFO Size Register 5  */
  __IOM uint32_t   DIEPTXF6;           /**< Device IN Endpoint Transmit FIFO Size Register 6  */

  uint32_t         RESERVED6[185U];    /**< Reserved for future use **/
  __IOM uint32_t   HCFG;               /**< Host Configuration Register  */
  __IOM uint32_t   HFIR;               /**< Host Frame Interval Register  */
  __IM uint32_t    HFNUM;              /**< Host Frame Number/Frame Time Remaining Register  */
  uint32_t         RESERVED7[1U];      /**< Reserved for future use **/
  __IM uint32_t    HPTXSTS;            /**< Host Periodic Transmit FIFO/Queue Status Register  */
  __IM uint32_t    HAINT;              /**< Host All Channels Interrupt Register  */
  __IOM uint32_t   HAINTMSK;           /**< Host All Channels Interrupt Mask Register  */
  uint32_t         RESERVED8[9U];      /**< Reserved for future use **/
  __IOM uint32_t   HPRT;               /**< Host Port Control and Status Register  */

  uint32_t         RESERVED9[47U];     /**< Reserved registers */
  USB_HC_TypeDef   HC[14U];            /**< Host Channel Registers */

  uint32_t         RESERVED10[80U];    /**< Reserved for future use **/
  __IOM uint32_t   DCFG;               /**< Device Configuration Register  */
  __IOM uint32_t   DCTL;               /**< Device Control Register  */
  __IM uint32_t    DSTS;               /**< Device Status Register  */
  uint32_t         RESERVED11[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DIEPMSK;            /**< Device IN Endpoint Common Interrupt Mask Register  */
  __IOM uint32_t   DOEPMSK;            /**< Device OUT Endpoint Common Interrupt Mask Register  */
  __IM uint32_t    DAINT;              /**< Device All Endpoints Interrupt Register  */
  __IOM uint32_t   DAINTMSK;           /**< Device All Endpoints Interrupt Mask Register  */
  uint32_t         RESERVED12[2U];     /**< Reserved for future use **/
  __IOM uint32_t   DVBUSDIS;           /**< Device VBUS Discharge Time Register  */
  __IOM uint32_t   DVBUSPULSE;         /**< Device VBUS Pulsing Time Register  */
  __IOM uint32_t   DTHRCTL;            /**< Device Threshold Control Register  */
  __IOM uint32_t   DIEPEMPMSK;         /**< Device IN Endpoint FIFO Empty Interrupt Mask Register  */

  uint32_t         RESERVED13[50U];    /**< Reserved for future use **/
  __IOM uint32_t   DIEP0CTL;           /**< Device Control IN Endpoint 0 Control Register  */
  uint32_t         RESERVED14[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DIEP0INT;           /**< Device IN Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED15[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DIEP0TSIZ;          /**< Device IN Endpoint 0 Transfer Size Register  */
  __IOM uint32_t   DIEP0DMAADDR;       /**< Device IN Endpoint 0 DMA Address Register  */
  __IM uint32_t    DIEP0TXFSTS;        /**< Device IN Endpoint Transmit FIFO Status Register 0  */

  uint32_t         RESERVED16[1U];     /**< Reserved registers */
  USB_DIEP_TypeDef DIEP[6U];           /**< Device IN Endpoint n Registers */

  uint32_t         RESERVED17[72U];    /**< Reserved for future use **/
  __IOM uint32_t   DOEP0CTL;           /**< Device Control OUT Endpoint 0 Control Register  */
  uint32_t         RESERVED18[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DOEP0INT;           /**< Device OUT Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED19[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DOEP0TSIZ;          /**< Device OUT Endpoint 0 Transfer Size Register  */
  __IOM uint32_t   DOEP0DMAADDR;       /**< Device OUT Endpoint 0 DMA Address Register  */

