RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_usb.h
  uint32_t         RESERVED20[2U];     /**< Reserved registers */
  USB_DOEP_TypeDef DOEP[6U];           /**< Device OUT Endpoint n Registers */

  uint32_t         RESERVED21[136U];   /**< Reserved for future use **/
  __IOM uint32_t   PCGCCTL;            /**< Power and Clock Gating Control Register  */

  uint32_t         RESERVED22[127U];   /**< Reserved registers */
  __IOM uint32_t   FIFO0D[512U];       /**< Device EP 0/Host Channel 0 FIFO  */

  uint32_t         RESERVED23[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO1D[512U];       /**< Device EP 1/Host Channel 1 FIFO  */

  uint32_t         RESERVED24[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO2D[512U];       /**< Device EP 2/Host Channel 2 FIFO  */

  uint32_t         RESERVED25[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO3D[512U];       /**< Device EP 3/Host Channel 3 FIFO  */

  uint32_t         RESERVED26[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO4D[512U];       /**< Device EP 4/Host Channel 4 FIFO  */

  uint32_t         RESERVED27[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO5D[512U];       /**< Device EP 5/Host Channel 5 FIFO  */

  uint32_t         RESERVED28[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO6D[512U];       /**< Device EP 6/Host Channel 6 FIFO  */

  uint32_t         RESERVED29[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO7D[512U];       /**< Host Channel 7 FIFO  */

  uint32_t         RESERVED30[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO8D[512U];       /**< Host Channel 8 FIFO  */

  uint32_t         RESERVED31[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO9D[512U];       /**< Host Channel 9 FIFO  */

  uint32_t         RESERVED32[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO10D[512U];      /**< Host Channel 10 FIFO  */

  uint32_t         RESERVED33[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO11D[512U];      /**< Host Channel 11 FIFO  */

  uint32_t         RESERVED34[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO12D[512U];      /**< Host Channel 12 FIFO  */

  uint32_t         RESERVED35[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO13D[512U];      /**< Host Channel 13 FIFO  */

  uint32_t         RESERVED36[17920U]; /**< Reserved registers */
  __IOM uint32_t   FIFORAM[512U];      /**< Direct Access to Data FIFO RAM for Debugging (2 KB)  */
} USB_TypeDef;                         /** @} */

/***************************************************************************//**
 * @addtogroup EFM32GG12B_USB
 * @{
 * @defgroup EFM32GG12B_USB_BitFields  USB Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for USB CTRL */
#define _USB_CTRL_RESETVALUE                       0x00000020UL                             /**< Default value for USB_CTRL */
#define _USB_CTRL_MASK                             0xFE0012B9UL                             /**< Mask for USB_CTRL */
#define USB_CTRL_VBUSENAP                          (0x1UL << 0)                             /**< VBUSEN Active Polarity */
#define _USB_CTRL_VBUSENAP_SHIFT                   0                                        /**< Shift value for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_MASK                    0x1UL                                    /**< Bit mask for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_VBUSENAP_HIGH                    0x00000000UL                             /**< Mode HIGH for USB_CTRL */
#define _USB_CTRL_VBUSENAP_LOW                     0x00000001UL                             /**< Mode LOW for USB_CTRL */
#define USB_CTRL_VBUSENAP_DEFAULT                  (_USB_CTRL_VBUSENAP_DEFAULT << 0)        /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_VBUSENAP_HIGH                     (_USB_CTRL_VBUSENAP_HIGH << 0)           /**< Shifted mode HIGH for USB_CTRL */
#define USB_CTRL_VBUSENAP_LOW                      (_USB_CTRL_VBUSENAP_LOW << 0)            /**< Shifted mode LOW for USB_CTRL */
#define USB_CTRL_SELFPOWERED                       (0x1UL << 3)                             /**< PHY Power */
#define _USB_CTRL_SELFPOWERED_SHIFT                3                                        /**< Shift value for USB_SELFPOWERED */
#define _USB_CTRL_SELFPOWERED_MASK                 0x8UL                                    /**< Bit mask for USB_SELFPOWERED */
#define _USB_CTRL_SELFPOWERED_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_SELFPOWERED_LOW                  0x00000000UL                             /**< Mode LOW for USB_CTRL */
#define _USB_CTRL_SELFPOWERED_HIGH                 0x00000001UL                             /**< Mode HIGH for USB_CTRL */
#define USB_CTRL_SELFPOWERED_DEFAULT               (_USB_CTRL_SELFPOWERED_DEFAULT << 3)     /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_SELFPOWERED_LOW                   (_USB_CTRL_SELFPOWERED_LOW << 3)         /**< Shifted mode LOW for USB_CTRL */
#define USB_CTRL_SELFPOWERED_HIGH                  (_USB_CTRL_SELFPOWERED_HIGH << 3)        /**< Shifted mode HIGH for USB_CTRL */
#define _USB_CTRL_LEMOSCCTRL_SHIFT                 4                                        /**< Shift value for USB_LEMOSCCTRL */
#define _USB_CTRL_LEMOSCCTRL_MASK                  0x30UL                                   /**< Bit mask for USB_LEMOSCCTRL */
#define _USB_CTRL_LEMOSCCTRL_NONE                  0x00000000UL                             /**< Mode NONE for USB_CTRL */
#define _USB_CTRL_LEMOSCCTRL_GATE                  0x00000001UL                             /**< Mode GATE for USB_CTRL */
#define _USB_CTRL_LEMOSCCTRL_DEFAULT               0x00000002UL                             /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_LEMOSCCTRL_NONE                   (_USB_CTRL_LEMOSCCTRL_NONE << 4)         /**< Shifted mode NONE for USB_CTRL */
#define USB_CTRL_LEMOSCCTRL_GATE                   (_USB_CTRL_LEMOSCCTRL_GATE << 4)         /**< Shifted mode GATE for USB_CTRL */
#define USB_CTRL_LEMOSCCTRL_DEFAULT                (_USB_CTRL_LEMOSCCTRL_DEFAULT << 4)      /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_LEMPHYCTRL                        (0x1UL << 7)                             /**< Low Energy Mode USB PHY Control */
#define _USB_CTRL_LEMPHYCTRL_SHIFT                 7                                        /**< Shift value for USB_LEMPHYCTRL */
#define _USB_CTRL_LEMPHYCTRL_MASK                  0x80UL                                   /**< Bit mask for USB_LEMPHYCTRL */
#define _USB_CTRL_LEMPHYCTRL_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_LEMPHYCTRL_NONE                  0x00000000UL                             /**< Mode NONE for USB_CTRL */
#define _USB_CTRL_LEMPHYCTRL_LEM                   0x00000001UL                             /**< Mode LEM for USB_CTRL */
#define USB_CTRL_LEMPHYCTRL_DEFAULT                (_USB_CTRL_LEMPHYCTRL_DEFAULT << 7)      /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_LEMPHYCTRL_NONE                   (_USB_CTRL_LEMPHYCTRL_NONE << 7)         /**< Shifted mode NONE for USB_CTRL */
#define USB_CTRL_LEMPHYCTRL_LEM                    (_USB_CTRL_LEMPHYCTRL_LEM << 7)          /**< Shifted mode LEM for USB_CTRL */
#define USB_CTRL_LEMIDLEEN                         (0x1UL << 9)                             /**< Low Energy Mode on  Bus Idle Enable */
#define _USB_CTRL_LEMIDLEEN_SHIFT                  9                                        /**< Shift value for USB_LEMIDLEEN */
#define _USB_CTRL_LEMIDLEEN_MASK                   0x200UL                                  /**< Bit mask for USB_LEMIDLEEN */
#define _USB_CTRL_LEMIDLEEN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_LEMIDLEEN_DEFAULT                 (_USB_CTRL_LEMIDLEEN_DEFAULT << 9)       /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_IDCDEN                            (0x1UL << 12)                            /**< ID Pull-up Enable */
#define _USB_CTRL_IDCDEN_SHIFT                     12                                       /**< Shift value for USB_IDCDEN */
#define _USB_CTRL_IDCDEN_MASK                      0x1000UL                                 /**< Bit mask for USB_IDCDEN */
#define _USB_CTRL_IDCDEN_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_IDCDEN_DISABLED                  0x00000000UL                             /**< Mode DISABLED for USB_CTRL */
#define _USB_CTRL_IDCDEN_ENABLED                   0x00000001UL                             /**< Mode ENABLED for USB_CTRL */
#define USB_CTRL_IDCDEN_DEFAULT                    (_USB_CTRL_IDCDEN_DEFAULT << 12)         /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_IDCDEN_DISABLED                   (_USB_CTRL_IDCDEN_DISABLED << 12)        /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_IDCDEN_ENABLED                    (_USB_CTRL_IDCDEN_ENABLED << 12)         /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_OTGCLKCDIS                        (0x1UL << 25)                            /**< OTG CLKC Disable */
#define _USB_CTRL_OTGCLKCDIS_SHIFT                 25                                       /**< Shift value for USB_OTGCLKCDIS */
#define _USB_CTRL_OTGCLKCDIS_MASK                  0x2000000UL                              /**< Bit mask for USB_OTGCLKCDIS */
#define _USB_CTRL_OTGCLKCDIS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_OTGCLKCDIS_ENABLED               0x00000000UL                             /**< Mode ENABLED for USB_CTRL */
#define _USB_CTRL_OTGCLKCDIS_DISABLED              0x00000001UL                             /**< Mode DISABLED for USB_CTRL */
#define USB_CTRL_OTGCLKCDIS_DEFAULT                (_USB_CTRL_OTGCLKCDIS_DEFAULT << 25)     /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_OTGCLKCDIS_ENABLED                (_USB_CTRL_OTGCLKCDIS_ENABLED << 25)     /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_OTGCLKCDIS_DISABLED               (_USB_CTRL_OTGCLKCDIS_DISABLED << 25)    /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_OTGIDINDIS                        (0x1UL << 26)                            /**< OTG ID Input Disable */
#define _USB_CTRL_OTGIDINDIS_SHIFT                 26                                       /**< Shift value for USB_OTGIDINDIS */
#define _USB_CTRL_OTGIDINDIS_MASK                  0x4000000UL                              /**< Bit mask for USB_OTGIDINDIS */
#define _USB_CTRL_OTGIDINDIS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_OTGIDINDIS_ENABLED               0x00000000UL                             /**< Mode ENABLED for USB_CTRL */
#define _USB_CTRL_OTGIDINDIS_DISABLED              0x00000001UL                             /**< Mode DISABLED for USB_CTRL */
#define USB_CTRL_OTGIDINDIS_DEFAULT                (_USB_CTRL_OTGIDINDIS_DEFAULT << 26)     /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_OTGIDINDIS_ENABLED                (_USB_CTRL_OTGIDINDIS_ENABLED << 26)     /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_OTGIDINDIS_DISABLED               (_USB_CTRL_OTGIDINDIS_DISABLED << 26)    /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_OTGPHYCTRLDIS                     (0x1UL << 27)                            /**< OTG Control Signals to PHY Disable */
#define _USB_CTRL_OTGPHYCTRLDIS_SHIFT              27                                       /**< Shift value for USB_OTGPHYCTRLDIS */
#define _USB_CTRL_OTGPHYCTRLDIS_MASK               0x8000000UL                              /**< Bit mask for USB_OTGPHYCTRLDIS */
#define _USB_CTRL_OTGPHYCTRLDIS_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_OTGPHYCTRLDIS_ENABLED            0x00000000UL                             /**< Mode ENABLED for USB_CTRL */
#define _USB_CTRL_OTGPHYCTRLDIS_DISABLED           0x00000001UL                             /**< Mode DISABLED for USB_CTRL */
#define USB_CTRL_OTGPHYCTRLDIS_DEFAULT             (_USB_CTRL_OTGPHYCTRLDIS_DEFAULT << 27)  /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_OTGPHYCTRLDIS_ENABLED             (_USB_CTRL_OTGPHYCTRLDIS_ENABLED << 27)  /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_OTGPHYCTRLDIS_DISABLED            (_USB_CTRL_OTGPHYCTRLDIS_DISABLED << 27) /**< Shifted mode DISABLED for USB_CTRL */
#define _USB_CTRL_DCDEN_SHIFT                      28                                       /**< Shift value for USB_DCDEN */
#define _USB_CTRL_DCDEN_MASK                       0x30000000UL                             /**< Bit mask for USB_DCDEN */
#define _USB_CTRL_DCDEN_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_DCDEN_DISABLED                   0x00000000UL                             /**< Mode DISABLED for USB_CTRL */
#define _USB_CTRL_DCDEN_TIMEOUT                    0x00000002UL                             /**< Mode TIMEOUT for USB_CTRL */
#define _USB_CTRL_DCDEN_ENABLED                    0x00000003UL                             /**< Mode ENABLED for USB_CTRL */
#define USB_CTRL_DCDEN_DEFAULT                     (_USB_CTRL_DCDEN_DEFAULT << 28)          /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_DCDEN_DISABLED                    (_USB_CTRL_DCDEN_DISABLED << 28)         /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_DCDEN_TIMEOUT                     (_USB_CTRL_DCDEN_TIMEOUT << 28)          /**< Shifted mode TIMEOUT for USB_CTRL */
#define USB_CTRL_DCDEN_ENABLED                     (_USB_CTRL_DCDEN_ENABLED << 28)          /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_PDEN                              (0x1UL << 30)                            /**< Primary Detection Enable */
#define _USB_CTRL_PDEN_SHIFT                       30                                       /**< Shift value for USB_PDEN */
#define _USB_CTRL_PDEN_MASK                        0x40000000UL                             /**< Bit mask for USB_PDEN */
#define _USB_CTRL_PDEN_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_PDEN_DISABLED                    0x00000000UL                             /**< Mode DISABLED for USB_CTRL */
#define _USB_CTRL_PDEN_ENABLED                     0x00000001UL                             /**< Mode ENABLED for USB_CTRL */
#define USB_CTRL_PDEN_DEFAULT                      (_USB_CTRL_PDEN_DEFAULT << 30)           /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_PDEN_DISABLED                     (_USB_CTRL_PDEN_DISABLED << 30)          /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_PDEN_ENABLED                      (_USB_CTRL_PDEN_ENABLED << 30)           /**< Shifted mode ENABLED for USB_CTRL */
#define USB_CTRL_SDEN                              (0x1UL << 31)                            /**< Secondary Detection Enable */
#define _USB_CTRL_SDEN_SHIFT                       31                                       /**< Shift value for USB_SDEN */
#define _USB_CTRL_SDEN_MASK                        0x80000000UL                             /**< Bit mask for USB_SDEN */
#define _USB_CTRL_SDEN_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_SDEN_DISABLED                    0x00000000UL                             /**< Mode DISABLED for USB_CTRL */
#define _USB_CTRL_SDEN_ENABLED                     0x00000001UL                             /**< Mode ENABLED for USB_CTRL */
#define USB_CTRL_SDEN_DEFAULT                      (_USB_CTRL_SDEN_DEFAULT << 31)           /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_SDEN_DISABLED                     (_USB_CTRL_SDEN_DISABLED << 31)          /**< Shifted mode DISABLED for USB_CTRL */
#define USB_CTRL_SDEN_ENABLED                      (_USB_CTRL_SDEN_ENABLED << 31)           /**< Shifted mode ENABLED for USB_CTRL */

/* Bit fields for USB STATUS */
#define _USB_STATUS_RESETVALUE                     0x00000000UL                          /**< Default value for USB_STATUS */
#define _USB_STATUS_MASK                           0x0000BF05UL                          /**< Mask for USB_STATUS */
#define USB_STATUS_VBUSDETH                        (0x1UL << 0)                          /**< VBUS Detect High */
#define _USB_STATUS_VBUSDETH_SHIFT                 0                                     /**< Shift value for USB_VBUSDETH */
#define _USB_STATUS_VBUSDETH_MASK                  0x1UL                                 /**< Bit mask for USB_VBUSDETH */
#define _USB_STATUS_VBUSDETH_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_VBUSDETH_DEFAULT                (_USB_STATUS_VBUSDETH_DEFAULT << 0)   /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_LEMACTIVE                       (0x1UL << 2)                          /**< Low Energy Mode Active */
#define _USB_STATUS_LEMACTIVE_SHIFT                2                                     /**< Shift value for USB_LEMACTIVE */
#define _USB_STATUS_LEMACTIVE_MASK                 0x4UL                                 /**< Bit mask for USB_LEMACTIVE */
#define _USB_STATUS_LEMACTIVE_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_LEMACTIVE_DEFAULT               (_USB_STATUS_LEMACTIVE_DEFAULT << 2)  /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_DCDTO                           (0x1UL << 8)                          /**< Data Contact Detection Timeout */
#define _USB_STATUS_DCDTO_SHIFT                    8                                     /**< Shift value for USB_DCDTO */
#define _USB_STATUS_DCDTO_MASK                     0x100UL                               /**< Bit mask for USB_DCDTO */
#define _USB_STATUS_DCDTO_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define _USB_STATUS_DCDTO_NOTIME                   0x00000000UL                          /**< Mode NOTIME for USB_STATUS */
#define _USB_STATUS_DCDTO_TIMEOUT                  0x00000001UL                          /**< Mode TIMEOUT for USB_STATUS */
#define USB_STATUS_DCDTO_DEFAULT                   (_USB_STATUS_DCDTO_DEFAULT << 8)      /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_DCDTO_NOTIME                    (_USB_STATUS_DCDTO_NOTIME << 8)       /**< Shifted mode NOTIME for USB_STATUS */
#define USB_STATUS_DCDTO_TIMEOUT                   (_USB_STATUS_DCDTO_TIMEOUT << 8)      /**< Shifted mode TIMEOUT for USB_STATUS */
#define USB_STATUS_SDP                             (0x1UL << 9)                          /**< Standard Downstream Port Detected */
#define _USB_STATUS_SDP_SHIFT                      9                                     /**< Shift value for USB_SDP */
#define _USB_STATUS_SDP_MASK                       0x200UL                               /**< Bit mask for USB_SDP */
#define _USB_STATUS_SDP_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_SDP_DEFAULT                     (_USB_STATUS_SDP_DEFAULT << 9)        /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_CDP                             (0x1UL << 10)                         /**< Charging Downstream Port Detected */
#define _USB_STATUS_CDP_SHIFT                      10                                    /**< Shift value for USB_CDP */
#define _USB_STATUS_CDP_MASK                       0x400UL                               /**< Bit mask for USB_CDP */
#define _USB_STATUS_CDP_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_CDP_DEFAULT                     (_USB_STATUS_CDP_DEFAULT << 10)       /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_DCP                             (0x1UL << 11)                         /**< Dedicated Charging Port Detected */
#define _USB_STATUS_DCP_SHIFT                      11                                    /**< Shift value for USB_DCP */
#define _USB_STATUS_DCP_MASK                       0x800UL                               /**< Bit mask for USB_DCP */
#define _USB_STATUS_DCP_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_DCP_DEFAULT                     (_USB_STATUS_DCP_DEFAULT << 11)       /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_ACAFS                           (0x1UL << 12)                         /**< ACA Full Speed TypeB Device */
#define _USB_STATUS_ACAFS_SHIFT                    12                                    /**< Shift value for USB_ACAFS */
#define _USB_STATUS_ACAFS_MASK                     0x1000UL                              /**< Bit mask for USB_ACAFS */
#define _USB_STATUS_ACAFS_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_ACAFS_DEFAULT                   (_USB_STATUS_ACAFS_DEFAULT << 12)     /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_ACALS                           (0x1UL << 13)                         /**< ACA Low Speed TypeB Device */
#define _USB_STATUS_ACALS_SHIFT                    13                                    /**< Shift value for USB_ACALS */
#define _USB_STATUS_ACALS_MASK                     0x2000UL                              /**< Bit mask for USB_ACALS */
#define _USB_STATUS_ACALS_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_ACALS_DEFAULT                   (_USB_STATUS_ACALS_DEFAULT << 13)     /**< Shifted mode DEFAULT for USB_STATUS */
#define USB_STATUS_USBCDBUSY                       (0x1UL << 15)                         /**< USB Charger Detect Busy */
#define _USB_STATUS_USBCDBUSY_SHIFT                15                                    /**< Shift value for USB_USBCDBUSY */
#define _USB_STATUS_USBCDBUSY_MASK                 0x8000UL                              /**< Bit mask for USB_USBCDBUSY */
#define _USB_STATUS_USBCDBUSY_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_USBCDBUSY_DEFAULT               (_USB_STATUS_USBCDBUSY_DEFAULT << 15) /**< Shifted mode DEFAULT for USB_STATUS */

