RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_usb.h
/* Bit fields for USB DATTRIM1 */
#define _USB_DATTRIM1_RESETVALUE                   0x00000024UL                             /**< Default value for USB_DATTRIM1 */
#define _USB_DATTRIM1_MASK                         0x000FFFBFUL                             /**< Mask for USB_DATTRIM1 */
#define _USB_DATTRIM1_ROUT_SHIFT                   0                                        /**< Shift value for USB_ROUT */
#define _USB_DATTRIM1_ROUT_MASK                    0x3FUL                                   /**< Bit mask for USB_ROUT */
#define _USB_DATTRIM1_ROUT_DEFAULT                 0x00000024UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_ROUT_DEFAULT                  (_USB_DATTRIM1_ROUT_DEFAULT << 0)        /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_ENDLYPULLUP                   (0x1UL << 7)                             /**< Enables Delay of Pull in TX Mode for Both FS and LS */
#define _USB_DATTRIM1_ENDLYPULLUP_SHIFT            7                                        /**< Shift value for USB_ENDLYPULLUP */
#define _USB_DATTRIM1_ENDLYPULLUP_MASK             0x80UL                                   /**< Bit mask for USB_ENDLYPULLUP */
#define _USB_DATTRIM1_ENDLYPULLUP_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_ENDLYPULLUP_DEFAULT           (_USB_DATTRIM1_ENDLYPULLUP_DEFAULT << 7) /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_DLYPULLUPFS_SHIFT            8                                        /**< Shift value for USB_DLYPULLUPFS */
#define _USB_DATTRIM1_DLYPULLUPFS_MASK             0x300UL                                  /**< Bit mask for USB_DLYPULLUPFS */
#define _USB_DATTRIM1_DLYPULLUPFS_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_DLYPULLUPFS_DEFAULT           (_USB_DATTRIM1_DLYPULLUPFS_DEFAULT << 8) /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_VCRSFS_SHIFT                 10                                       /**< Shift value for USB_VCRSFS */
#define _USB_DATTRIM1_VCRSFS_MASK                  0xC00UL                                  /**< Bit mask for USB_VCRSFS */
#define _USB_DATTRIM1_VCRSFS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_VCRSFS_DEFAULT                (_USB_DATTRIM1_VCRSFS_DEFAULT << 10)     /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_TFDMFS_SHIFT                 12                                       /**< Shift value for USB_TFDMFS */
#define _USB_DATTRIM1_TFDMFS_MASK                  0x3000UL                                 /**< Bit mask for USB_TFDMFS */
#define _USB_DATTRIM1_TFDMFS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_TFDMFS_DEFAULT                (_USB_DATTRIM1_TFDMFS_DEFAULT << 12)     /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_TRDMFS_SHIFT                 14                                       /**< Shift value for USB_TRDMFS */
#define _USB_DATTRIM1_TRDMFS_MASK                  0xC000UL                                 /**< Bit mask for USB_TRDMFS */
#define _USB_DATTRIM1_TRDMFS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_TRDMFS_DEFAULT                (_USB_DATTRIM1_TRDMFS_DEFAULT << 14)     /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_TFDPFS_SHIFT                 16                                       /**< Shift value for USB_TFDPFS */
#define _USB_DATTRIM1_TFDPFS_MASK                  0x30000UL                                /**< Bit mask for USB_TFDPFS */
#define _USB_DATTRIM1_TFDPFS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_TFDPFS_DEFAULT                (_USB_DATTRIM1_TFDPFS_DEFAULT << 16)     /**< Shifted mode DEFAULT for USB_DATTRIM1 */
#define _USB_DATTRIM1_TRDPFS_SHIFT                 18                                       /**< Shift value for USB_TRDPFS */
#define _USB_DATTRIM1_TRDPFS_MASK                  0xC0000UL                                /**< Bit mask for USB_TRDPFS */
#define _USB_DATTRIM1_TRDPFS_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for USB_DATTRIM1 */
#define USB_DATTRIM1_TRDPFS_DEFAULT                (_USB_DATTRIM1_TRDPFS_DEFAULT << 18)     /**< Shifted mode DEFAULT for USB_DATTRIM1 */

/* Bit fields for USB LEMCTRL */
#define _USB_LEMCTRL_RESETVALUE                    0x00000067UL                         /**< Default value for USB_LEMCTRL */
#define _USB_LEMCTRL_MASK                          0x000003FFUL                         /**< Mask for USB_LEMCTRL */
#define _USB_LEMCTRL_TIMEBASE_SHIFT                0                                    /**< Shift value for USB_TIMEBASE */
#define _USB_LEMCTRL_TIMEBASE_MASK                 0x3FFUL                              /**< Bit mask for USB_TIMEBASE */
#define _USB_LEMCTRL_TIMEBASE_DEFAULT              0x00000067UL                         /**< Mode DEFAULT for USB_LEMCTRL */
#define USB_LEMCTRL_TIMEBASE_DEFAULT               (_USB_LEMCTRL_TIMEBASE_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_LEMCTRL */

/* Bit fields for USB ROUTELOC0 */
#define _USB_ROUTELOC0_RESETVALUE                  0x00000000UL                               /**< Default value for USB_ROUTELOC0 */
#define _USB_ROUTELOC0_MASK                        0x00000003UL                               /**< Mask for USB_ROUTELOC0 */
#define _USB_ROUTELOC0_VBUSENPENLOC_SHIFT          0                                          /**< Shift value for USB_VBUSENPENLOC */
#define _USB_ROUTELOC0_VBUSENPENLOC_MASK           0x3UL                                      /**< Bit mask for USB_VBUSENPENLOC */
#define _USB_ROUTELOC0_VBUSENPENLOC_LOC0           0x00000000UL                               /**< Mode LOC0 for USB_ROUTELOC0 */
#define _USB_ROUTELOC0_VBUSENPENLOC_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USB_ROUTELOC0 */
#define _USB_ROUTELOC0_VBUSENPENLOC_LOC1           0x00000001UL                               /**< Mode LOC1 for USB_ROUTELOC0 */
#define _USB_ROUTELOC0_VBUSENPENLOC_LOC2           0x00000002UL                               /**< Mode LOC2 for USB_ROUTELOC0 */
#define USB_ROUTELOC0_VBUSENPENLOC_LOC0            (_USB_ROUTELOC0_VBUSENPENLOC_LOC0 << 0)    /**< Shifted mode LOC0 for USB_ROUTELOC0 */
#define USB_ROUTELOC0_VBUSENPENLOC_DEFAULT         (_USB_ROUTELOC0_VBUSENPENLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_ROUTELOC0 */
#define USB_ROUTELOC0_VBUSENPENLOC_LOC1            (_USB_ROUTELOC0_VBUSENPENLOC_LOC1 << 0)    /**< Shifted mode LOC1 for USB_ROUTELOC0 */
#define USB_ROUTELOC0_VBUSENPENLOC_LOC2            (_USB_ROUTELOC0_VBUSENPENLOC_LOC2 << 0)    /**< Shifted mode LOC2 for USB_ROUTELOC0 */

/* Bit fields for USB GOTGCTL */
#define _USB_GOTGCTL_RESETVALUE                    0x00010000UL                                 /**< Default value for USB_GOTGCTL */
#define _USB_GOTGCTL_MASK                          0x003F9FFFUL                                 /**< Mask for USB_GOTGCTL */
#define USB_GOTGCTL_SESREQSCS                      (0x1UL << 0)                                 /**< Session Request Success */
#define _USB_GOTGCTL_SESREQSCS_SHIFT               0                                            /**< Shift value for USB_SESREQSCS */
#define _USB_GOTGCTL_SESREQSCS_MASK                0x1UL                                        /**< Bit mask for USB_SESREQSCS */
#define _USB_GOTGCTL_SESREQSCS_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_SESREQSCS_DEFAULT              (_USB_GOTGCTL_SESREQSCS_DEFAULT << 0)        /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_SESREQ                         (0x1UL << 1)                                 /**< Session Request */
#define _USB_GOTGCTL_SESREQ_SHIFT                  1                                            /**< Shift value for USB_SESREQ */
#define _USB_GOTGCTL_SESREQ_MASK                   0x2UL                                        /**< Bit mask for USB_SESREQ */
#define _USB_GOTGCTL_SESREQ_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_SESREQ_DEFAULT                 (_USB_GOTGCTL_SESREQ_DEFAULT << 1)           /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_VBVALIDOVEN                    (0x1UL << 2)                                 /**< VBUS Valid Override Enable */
#define _USB_GOTGCTL_VBVALIDOVEN_SHIFT             2                                            /**< Shift value for USB_VBVALIDOVEN */
#define _USB_GOTGCTL_VBVALIDOVEN_MASK              0x4UL                                        /**< Bit mask for USB_VBVALIDOVEN */
#define _USB_GOTGCTL_VBVALIDOVEN_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_VBVALIDOVEN_DEFAULT            (_USB_GOTGCTL_VBVALIDOVEN_DEFAULT << 2)      /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_VBVALIDOVVAL                   (0x1UL << 3)                                 /**< VBUS Valid OverrideValue */
#define _USB_GOTGCTL_VBVALIDOVVAL_SHIFT            3                                            /**< Shift value for USB_VBVALIDOVVAL */
#define _USB_GOTGCTL_VBVALIDOVVAL_MASK             0x8UL                                        /**< Bit mask for USB_VBVALIDOVVAL */
#define _USB_GOTGCTL_VBVALIDOVVAL_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_VBVALIDOVVAL_DEFAULT           (_USB_GOTGCTL_VBVALIDOVVAL_DEFAULT << 3)     /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_AVALIDOVEN                     (0x1UL << 4)                                 /**< A-Peripheral Session Valid Override Enable */
#define _USB_GOTGCTL_AVALIDOVEN_SHIFT              4                                            /**< Shift value for USB_AVALIDOVEN */
#define _USB_GOTGCTL_AVALIDOVEN_MASK               0x10UL                                       /**< Bit mask for USB_AVALIDOVEN */
#define _USB_GOTGCTL_AVALIDOVEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_AVALIDOVEN_DEFAULT             (_USB_GOTGCTL_AVALIDOVEN_DEFAULT << 4)       /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_AVALIDOVVAL                    (0x1UL << 5)                                 /**< A-Peripheral Session Valid OverrideValue */
#define _USB_GOTGCTL_AVALIDOVVAL_SHIFT             5                                            /**< Shift value for USB_AVALIDOVVAL */
#define _USB_GOTGCTL_AVALIDOVVAL_MASK              0x20UL                                       /**< Bit mask for USB_AVALIDOVVAL */
#define _USB_GOTGCTL_AVALIDOVVAL_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_AVALIDOVVAL_DEFAULT            (_USB_GOTGCTL_AVALIDOVVAL_DEFAULT << 5)      /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BVALIDOVEN                     (0x1UL << 6)                                 /**< B-Peripheral Session Valid Override Enable */
#define _USB_GOTGCTL_BVALIDOVEN_SHIFT              6                                            /**< Shift value for USB_BVALIDOVEN */
#define _USB_GOTGCTL_BVALIDOVEN_MASK               0x40UL                                       /**< Bit mask for USB_BVALIDOVEN */
#define _USB_GOTGCTL_BVALIDOVEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BVALIDOVEN_DEFAULT             (_USB_GOTGCTL_BVALIDOVEN_DEFAULT << 6)       /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BVALIDOVVAL                    (0x1UL << 7)                                 /**< B-Peripheral Session Valid OverrideValue */
#define _USB_GOTGCTL_BVALIDOVVAL_SHIFT             7                                            /**< Shift value for USB_BVALIDOVVAL */
#define _USB_GOTGCTL_BVALIDOVVAL_MASK              0x80UL                                       /**< Bit mask for USB_BVALIDOVVAL */
#define _USB_GOTGCTL_BVALIDOVVAL_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BVALIDOVVAL_DEFAULT            (_USB_GOTGCTL_BVALIDOVVAL_DEFAULT << 7)      /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HSTNEGSCS                      (0x1UL << 8)                                 /**< Host Negotiation Success */
#define _USB_GOTGCTL_HSTNEGSCS_SHIFT               8                                            /**< Shift value for USB_HSTNEGSCS */
#define _USB_GOTGCTL_HSTNEGSCS_MASK                0x100UL                                      /**< Bit mask for USB_HSTNEGSCS */
#define _USB_GOTGCTL_HSTNEGSCS_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HSTNEGSCS_DEFAULT              (_USB_GOTGCTL_HSTNEGSCS_DEFAULT << 8)        /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HNPREQ                         (0x1UL << 9)                                 /**< HNP Request */
#define _USB_GOTGCTL_HNPREQ_SHIFT                  9                                            /**< Shift value for USB_HNPREQ */
#define _USB_GOTGCTL_HNPREQ_MASK                   0x200UL                                      /**< Bit mask for USB_HNPREQ */
#define _USB_GOTGCTL_HNPREQ_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HNPREQ_DEFAULT                 (_USB_GOTGCTL_HNPREQ_DEFAULT << 9)           /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HSTSETHNPEN                    (0x1UL << 10)                                /**< Host Set HNP Enable */
#define _USB_GOTGCTL_HSTSETHNPEN_SHIFT             10                                           /**< Shift value for USB_HSTSETHNPEN */
#define _USB_GOTGCTL_HSTSETHNPEN_MASK              0x400UL                                      /**< Bit mask for USB_HSTSETHNPEN */
#define _USB_GOTGCTL_HSTSETHNPEN_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_HSTSETHNPEN_DEFAULT            (_USB_GOTGCTL_HSTSETHNPEN_DEFAULT << 10)     /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DEVHNPEN                       (0x1UL << 11)                                /**< Device HNP Enabled */
#define _USB_GOTGCTL_DEVHNPEN_SHIFT                11                                           /**< Shift value for USB_DEVHNPEN */
#define _USB_GOTGCTL_DEVHNPEN_MASK                 0x800UL                                      /**< Bit mask for USB_DEVHNPEN */
#define _USB_GOTGCTL_DEVHNPEN_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DEVHNPEN_DEFAULT               (_USB_GOTGCTL_DEVHNPEN_DEFAULT << 11)        /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_EHEN                           (0x1UL << 12)                                /**< Embedded Host Enable */
#define _USB_GOTGCTL_EHEN_SHIFT                    12                                           /**< Shift value for USB_EHEN */
#define _USB_GOTGCTL_EHEN_MASK                     0x1000UL                                     /**< Bit mask for USB_EHEN */
#define _USB_GOTGCTL_EHEN_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_EHEN_DEFAULT                   (_USB_GOTGCTL_EHEN_DEFAULT << 12)            /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DBNCEFLTRBYPASS                (0x1UL << 15)                                /**< Debounce Filter Bypass */
#define _USB_GOTGCTL_DBNCEFLTRBYPASS_SHIFT         15                                           /**< Shift value for USB_DBNCEFLTRBYPASS */
#define _USB_GOTGCTL_DBNCEFLTRBYPASS_MASK          0x8000UL                                     /**< Bit mask for USB_DBNCEFLTRBYPASS */
#define _USB_GOTGCTL_DBNCEFLTRBYPASS_DEFAULT       0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DBNCEFLTRBYPASS_DEFAULT        (_USB_GOTGCTL_DBNCEFLTRBYPASS_DEFAULT << 15) /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_CONIDSTS                       (0x1UL << 16)                                /**< Connector ID Status */
#define _USB_GOTGCTL_CONIDSTS_SHIFT                16                                           /**< Shift value for USB_CONIDSTS */
#define _USB_GOTGCTL_CONIDSTS_MASK                 0x10000UL                                    /**< Bit mask for USB_CONIDSTS */
#define _USB_GOTGCTL_CONIDSTS_DEFAULT              0x00000001UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_CONIDSTS_DEFAULT               (_USB_GOTGCTL_CONIDSTS_DEFAULT << 16)        /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DBNCTIME                       (0x1UL << 17)                                /**< Long/Short Debounce Time */
#define _USB_GOTGCTL_DBNCTIME_SHIFT                17                                           /**< Shift value for USB_DBNCTIME */
#define _USB_GOTGCTL_DBNCTIME_MASK                 0x20000UL                                    /**< Bit mask for USB_DBNCTIME */
#define _USB_GOTGCTL_DBNCTIME_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_DBNCTIME_DEFAULT               (_USB_GOTGCTL_DBNCTIME_DEFAULT << 17)        /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_ASESVLD                        (0x1UL << 18)                                /**< A-Session Valid */
#define _USB_GOTGCTL_ASESVLD_SHIFT                 18                                           /**< Shift value for USB_ASESVLD */
#define _USB_GOTGCTL_ASESVLD_MASK                  0x40000UL                                    /**< Bit mask for USB_ASESVLD */
#define _USB_GOTGCTL_ASESVLD_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_ASESVLD_DEFAULT                (_USB_GOTGCTL_ASESVLD_DEFAULT << 18)         /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BSESVLD                        (0x1UL << 19)                                /**< B-Session Valid */
#define _USB_GOTGCTL_BSESVLD_SHIFT                 19                                           /**< Shift value for USB_BSESVLD */
#define _USB_GOTGCTL_BSESVLD_MASK                  0x80000UL                                    /**< Bit mask for USB_BSESVLD */
#define _USB_GOTGCTL_BSESVLD_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_BSESVLD_DEFAULT                (_USB_GOTGCTL_BSESVLD_DEFAULT << 19)         /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_OTGVER                         (0x1UL << 20)                                /**< OTG Version */
#define _USB_GOTGCTL_OTGVER_SHIFT                  20                                           /**< Shift value for USB_OTGVER */
#define _USB_GOTGCTL_OTGVER_MASK                   0x100000UL                                   /**< Bit mask for USB_OTGVER */
#define _USB_GOTGCTL_OTGVER_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_OTGVER_DEFAULT                 (_USB_GOTGCTL_OTGVER_DEFAULT << 20)          /**< Shifted mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_CURMOD                         (0x1UL << 21)                                /**< Current Mode of Operation */
#define _USB_GOTGCTL_CURMOD_SHIFT                  21                                           /**< Shift value for USB_CURMOD */
#define _USB_GOTGCTL_CURMOD_MASK                   0x200000UL                                   /**< Bit mask for USB_CURMOD */
#define _USB_GOTGCTL_CURMOD_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USB_GOTGCTL */
#define USB_GOTGCTL_CURMOD_DEFAULT                 (_USB_GOTGCTL_CURMOD_DEFAULT << 21)          /**< Shifted mode DEFAULT for USB_GOTGCTL */

